palestra-2018-02-06.org
# Local variables:
# after-save-hook: org-reveal-export-to-html
# end:
#+OPTIONS: toc:nil reveal_slide_number:nil reveal_progress:nil num:nil
#+TITLE: Geradores, promessas e estruturas funcionais em javascript

* Prólogo - ES6/7/8/...
** =const/let=

/function scope/

#+BEGIN_SRC javascript
function weird () {
  var myList = [1,2,3,4];
  for (var i in myList) {
    /* ... */
  }

  console.log(i); // "3" (more on this later)
}
#+END_SRC

Calma que piora...
#+ATTR_REVEAL: :frag roll-in
#+BEGIN_SRC javascript
function weirder () {
  var myList = [1,2,3,4];
  for (var i in myList) {
    /* ... */
    var internal = 100;
  }

  internal += " xorah!"
  console.log(internal); // "100 xorah!"
}
#+END_SRC

** =const/let=

/block scope/

#+BEGIN_SRC javascript
function sane () {
  const myList = [1,2,3,4];
  for (const i in myList) {
    /* ... */
  }

  console.log(i); // ReferenceError: i is not defined
}
#+END_SRC

** =const/let=

#+BEGIN_SRC javascript
function whyUseConst () {
  const myList = [1,2,3,4];

  myList.push(5); // not a problem
  console.log(myList); // [1,2,3,4,5]

  myList = ["not", "ok"]; // TypeError: invalid assignment to const `myList'
  console.log(myList);
}
#+END_SRC

#+ATTR_REVEAL: :frag roll-in
#+BEGIN_SRC javascript
function letLetsItChange () {
  let myList = [1,2,3,4];

  myList = ["why", "not?"];
  console.log(myList.join(" ")); // "why not?"
}

#+END_SRC
** /arrow functions/

#+BEGIN_SRC javascript
const numbers = [1,2,3,4,5];

const awkward = numbers.findIndex(function (element) {
  return element === 3;
};
#+END_SRC

#+ATTR_REVEAL: :frag roll-in
#+BEGIN_SRC javascript
const nicer = numbers.findIndex(element => element === 3);
#+END_SRC

