palestra-2018-02-06.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Geradores, promessas e estruturas funcionais em javascript</title>
<meta name="author" content="(Gustavo Roscoe)"/>
<link rel="stylesheet" href="http://cdn.jsdelivr.net/reveal.js/3.0.0/css/reveal.css"/>

<link rel="stylesheet" href="http://cdn.jsdelivr.net/reveal.js/3.0.0/css/theme/moon.css" id="theme"/>


<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide"><h1 class='title'>Geradores, promessas e estruturas funcionais em javascript</h1>
</section>

<section>
<section id="slide-org50835f2">
<h2 id="org50835f2">Prólogo - ES6/7/8/&#x2026;</h2>
<div class="outline-text-2" id="text-org50835f2">
</div>
</section>
<section id="slide-orgee4075a">
<h3 id="orgee4075a"><code>const/let</code></h3>
<p>
<i>function scope</i>
</p>

<div class="org-src-container">

<pre  class="src src-javascript"><span style="color: #c678dd; font-weight: bold;">function</span> <span style="color: #61afef; font-weight: bold;">weird</span> <span style="color: #4f97d7;">()</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #c678dd; font-weight: bold;">var</span> <span style="color: #61afef;">myList</span> = <span style="color: #bc6ec5;">[</span><span style="color: #da8548; font-weight: bold;">1</span>,<span style="color: #da8548; font-weight: bold;">2</span>,<span style="color: #da8548; font-weight: bold;">3</span>,<span style="color: #da8548; font-weight: bold;">4</span><span style="color: #bc6ec5;">]</span>;
  <span style="color: #c678dd; font-weight: bold;">for</span> <span style="color: #bc6ec5;">(</span><span style="color: #c678dd; font-weight: bold;">var</span> <span style="color: #61afef;">i</span> <span style="color: #c678dd; font-weight: bold;">in</span> myList<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
    <span style="color: #687080; background-color: #292e34; font-style: italic;">/* </span><span style="color: #687080; background-color: #292e34; font-style: italic;">... */</span>
  <span style="color: #bc6ec5;">}</span>

  console.log<span style="color: #bc6ec5;">(</span>i<span style="color: #bc6ec5;">)</span>; <span style="color: #687080; background-color: #292e34; font-style: italic;">// </span><span style="color: #687080; background-color: #292e34; font-style: italic;">"3" (more on this later)</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>

<p>
Calma que piora&#x2026;
</p>
<div class="org-src-container">

<pre  class="fragment roll-in"><span style="color: #c678dd; font-weight: bold;">function</span> <span style="color: #61afef; font-weight: bold;">weirder</span> <span style="color: #4f97d7;">()</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #c678dd; font-weight: bold;">var</span> <span style="color: #61afef;">myList</span> = <span style="color: #bc6ec5;">[</span><span style="color: #da8548; font-weight: bold;">1</span>,<span style="color: #da8548; font-weight: bold;">2</span>,<span style="color: #da8548; font-weight: bold;">3</span>,<span style="color: #da8548; font-weight: bold;">4</span><span style="color: #bc6ec5;">]</span>;
  <span style="color: #c678dd; font-weight: bold;">for</span> <span style="color: #bc6ec5;">(</span><span style="color: #c678dd; font-weight: bold;">var</span> <span style="color: #61afef;">i</span> <span style="color: #c678dd; font-weight: bold;">in</span> myList<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
    <span style="color: #687080; background-color: #292e34; font-style: italic;">/* </span><span style="color: #687080; background-color: #292e34; font-style: italic;">... */</span>
    <span style="color: #c678dd; font-weight: bold;">var</span> <span style="color: #61afef;">internal</span> = <span style="color: #da8548; font-weight: bold;">100</span>;
  <span style="color: #bc6ec5;">}</span>

  internal += <span style="color: #98be65;">" xorah!"</span>
  console.log<span style="color: #bc6ec5;">(</span>internal<span style="color: #bc6ec5;">)</span>; <span style="color: #687080; background-color: #292e34; font-style: italic;">// </span><span style="color: #687080; background-color: #292e34; font-style: italic;">"100 xorah!"</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>

</section>
<section id="slide-org7ce9a40">
<h3 id="org7ce9a40"><code>const/let</code></h3>
<p>
<i>block scope</i>
</p>

<div class="org-src-container">

<pre  class="src src-javascript"><span style="color: #c678dd; font-weight: bold;">function</span> <span style="color: #61afef; font-weight: bold;">sane</span> <span style="color: #4f97d7;">()</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">myList</span> = <span style="color: #bc6ec5;">[</span><span style="color: #da8548; font-weight: bold;">1</span>,<span style="color: #da8548; font-weight: bold;">2</span>,<span style="color: #da8548; font-weight: bold;">3</span>,<span style="color: #da8548; font-weight: bold;">4</span><span style="color: #bc6ec5;">]</span>;
  <span style="color: #c678dd; font-weight: bold;">for</span> <span style="color: #bc6ec5;">(</span><span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">i</span> <span style="color: #c678dd; font-weight: bold;">in</span> myList<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
    <span style="color: #687080; background-color: #292e34; font-style: italic;">/* </span><span style="color: #687080; background-color: #292e34; font-style: italic;">... */</span>
  <span style="color: #bc6ec5;">}</span>

  console.log<span style="color: #bc6ec5;">(</span>i<span style="color: #bc6ec5;">)</span>; <span style="color: #687080; background-color: #292e34; font-style: italic;">// </span><span style="color: #687080; background-color: #292e34; font-style: italic;">ReferenceError: i is not defined</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>

</section>
<section id="slide-orge5cefa6">
<h3 id="orge5cefa6"><code>const/let</code></h3>
<div class="org-src-container">

<pre  class="src src-javascript"><span style="color: #c678dd; font-weight: bold;">function</span> <span style="color: #61afef; font-weight: bold;">whyUseConst</span> <span style="color: #4f97d7;">()</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">myList</span> = <span style="color: #bc6ec5;">[</span><span style="color: #da8548; font-weight: bold;">1</span>,<span style="color: #da8548; font-weight: bold;">2</span>,<span style="color: #da8548; font-weight: bold;">3</span>,<span style="color: #da8548; font-weight: bold;">4</span><span style="color: #bc6ec5;">]</span>;

  myList.push<span style="color: #bc6ec5;">(</span><span style="color: #da8548; font-weight: bold;">5</span><span style="color: #bc6ec5;">)</span>; <span style="color: #687080; background-color: #292e34; font-style: italic;">// </span><span style="color: #687080; background-color: #292e34; font-style: italic;">not a problem</span>
  console.log<span style="color: #bc6ec5;">(</span>myList<span style="color: #bc6ec5;">)</span>; <span style="color: #687080; background-color: #292e34; font-style: italic;">// </span><span style="color: #687080; background-color: #292e34; font-style: italic;">[1,2,3,4,5]</span>

  myList = <span style="color: #bc6ec5;">[</span><span style="color: #98be65;">"not"</span>, <span style="color: #98be65;">"ok"</span><span style="color: #bc6ec5;">]</span>; <span style="color: #687080; background-color: #292e34; font-style: italic;">// </span><span style="color: #687080; background-color: #292e34; font-style: italic;">TypeError: invalid assignment to const `myList'</span>
  console.log<span style="color: #bc6ec5;">(</span>myList<span style="color: #bc6ec5;">)</span>;
<span style="color: #4f97d7;">}</span>
</pre>
</div>

<div class="org-src-container">

<pre  class="fragment roll-in"><span style="color: #c678dd; font-weight: bold;">function</span> <span style="color: #61afef; font-weight: bold;">letLetsItChange</span> <span style="color: #4f97d7;">()</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #c678dd; font-weight: bold;">let</span> <span style="color: #61afef;">myList</span> = <span style="color: #bc6ec5;">[</span><span style="color: #da8548; font-weight: bold;">1</span>,<span style="color: #da8548; font-weight: bold;">2</span>,<span style="color: #da8548; font-weight: bold;">3</span>,<span style="color: #da8548; font-weight: bold;">4</span><span style="color: #bc6ec5;">]</span>;

  myList = <span style="color: #bc6ec5;">[</span><span style="color: #98be65;">"why"</span>, <span style="color: #98be65;">"not?"</span><span style="color: #bc6ec5;">]</span>;
  console.log<span style="color: #bc6ec5;">(</span>myList.join<span style="color: #2d9574;">(</span><span style="color: #98be65;">" "</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>; <span style="color: #687080; background-color: #292e34; font-style: italic;">// </span><span style="color: #687080; background-color: #292e34; font-style: italic;">"why not?"</span>
<span style="color: #4f97d7;">}</span>

</pre>
</div>
</section>
<section id="slide-orgb874889">
<h3 id="orgb874889"><i>arrow functions</i></h3>
<div class="org-src-container">

<pre  class="src src-javascript"><span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">numbers</span> = <span style="color: #4f97d7;">[</span><span style="color: #da8548; font-weight: bold;">1</span>,<span style="color: #da8548; font-weight: bold;">2</span>,<span style="color: #da8548; font-weight: bold;">3</span>,<span style="color: #da8548; font-weight: bold;">4</span>,<span style="color: #da8548; font-weight: bold;">5</span><span style="color: #4f97d7;">]</span>;

<span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">awkward</span> = numbers.findIndex<span style="color: #4f97d7;">(</span><span style="color: #c678dd; font-weight: bold;">function</span> <span style="color: #bc6ec5;">(</span><span style="color: #61afef;">element</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
  <span style="color: #c678dd; font-weight: bold;">return</span> element === <span style="color: #da8548; font-weight: bold;">3</span>;
<span style="color: #bc6ec5;">}</span>;
</pre>
</div>

<div class="org-src-container">

<pre  class="fragment roll-in"><span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">nicer</span> = numbers.findIndex<span style="color: #4f97d7;">(</span>element =&gt; element === <span style="color: #da8548; font-weight: bold;">3</span><span style="color: #4f97d7;">)</span>;
</pre>
</div>

</section>
