palestra-2018-02-06.org
** Desestruturação e /rest parameters/
#+BEGIN_SRC javascript
const [x, y] = [1, 2];
console.log(x); // 1
console.log(y); // 2
#+END_SRC

#+ATTR_REVEAL: :frag roll-in
#+BEGIN_SRC javascript
const [head, ...tail] = [1,2,3];
console.log(head); // 1
console.log(tail); // [2, 3]
console.log([...tail, ...tail]); // [2, 3, 2, 3]
#+END_SRC

#+ATTR_REVEAL: :frag roll-in
#+BEGIN_SRC javascript
function worksForFunctionsToo (first, ...rest) {
  return rest.concat(first);
}
console.log(worksForFunctionsToo(1,2,3)); // [2, 3, 1]
#+END_SRC
** =for ... of=

#+BEGIN_SRC javascript
const numbers = [1,2,3,4,5];
for (const i in numbers) {
  const k = numbers[i];
  console.log(i + 1); // "01", "11", etc.
  /* ... */
}
#+END_SRC

#+ATTR_REVEAL: :frag roll-in
#+BEGIN_SRC javascript
for (const number of numbers) {
  const k = numbers;
  /* ... */
}
#+END_SRC

#+ATTR_REVEAL: :frag roll-in
#+BEGIN_SRC javascript
for (const [index, number] of numbers.entries()) {
  const k = numbers;
  console.log(index + 1); // 1, 2, ...
  /* ... */
}
#+END_SRC

** E mais...

   - Promessas
   - Geradores
   - Funções assíncronas
   - Módulos nativos, /proxies/, etc.

* Controle de complexidade

  - Abstração
  - Composição

** Abstração

DRY - *D*on't *R*epeat *Y*ourself

#+BEGIN_SRC javascript
function addOne (list) {
  const newList = [];
  for (const element of list) {
    newList.push(element + 1);
  }

  return newList;
}

function square (list) {
  const newList = [];
  for (const element of list) {
    newList.push(element * element);
  }

  return newList;
}
#+END_SRC

** Abstração

#+BEGIN_SRC javascript
function map (list, fn) {
  const newList = [];
  for (let element of list) {
    newList.push(fn(element));
  }

  return newList;
}

const addOne = (list) => map(list, x => x+1);
const square = (list) => map(list, x => x*x);
#+END_SRC

