palestra-2018-02-06.html
<section id="slide-org75c809d">
<h3 id="org75c809d">Desestruturação e <i>rest parameters</i></h3>
<div class="org-src-container">

<pre  class="src src-javascript"><span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #4f97d7;">[</span><span style="color: #61afef;">x</span>, <span style="color: #61afef;">y</span><span style="color: #4f97d7;">]</span> = <span style="color: #4f97d7;">[</span><span style="color: #da8548; font-weight: bold;">1</span>, <span style="color: #da8548; font-weight: bold;">2</span><span style="color: #4f97d7;">]</span>;
console.log<span style="color: #4f97d7;">(</span>x<span style="color: #4f97d7;">)</span>; <span style="color: #687080; background-color: #292e34; font-style: italic;">// </span><span style="color: #687080; background-color: #292e34; font-style: italic;">1</span>
console.log<span style="color: #4f97d7;">(</span>y<span style="color: #4f97d7;">)</span>; <span style="color: #687080; background-color: #292e34; font-style: italic;">// </span><span style="color: #687080; background-color: #292e34; font-style: italic;">2</span>
</pre>
</div>

<div class="org-src-container">

<pre  class="fragment roll-in"><span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #4f97d7;">[</span>head, ...tail<span style="color: #4f97d7;">]</span> = <span style="color: #4f97d7;">[</span><span style="color: #da8548; font-weight: bold;">1</span>,<span style="color: #da8548; font-weight: bold;">2</span>,<span style="color: #da8548; font-weight: bold;">3</span><span style="color: #4f97d7;">]</span>;
console.log<span style="color: #4f97d7;">(</span>head<span style="color: #4f97d7;">)</span>; <span style="color: #687080; background-color: #292e34; font-style: italic;">// </span><span style="color: #687080; background-color: #292e34; font-style: italic;">1</span>
console.log<span style="color: #4f97d7;">(</span>tail<span style="color: #4f97d7;">)</span>; <span style="color: #687080; background-color: #292e34; font-style: italic;">// </span><span style="color: #687080; background-color: #292e34; font-style: italic;">[2, 3]</span>
console.log<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">[</span>...tail, ...tail<span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">)</span>; <span style="color: #687080; background-color: #292e34; font-style: italic;">// </span><span style="color: #687080; background-color: #292e34; font-style: italic;">[2, 3, 2, 3]</span>
</pre>
</div>

<div class="org-src-container">

<pre  class="fragment roll-in"><span style="color: #c678dd; font-weight: bold;">function</span> <span style="color: #61afef; font-weight: bold;">worksForFunctionsToo</span> <span style="color: #4f97d7;">(</span><span style="color: #61afef;">first</span>, ...<span style="color: #61afef;">rest</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #c678dd; font-weight: bold;">return</span> rest.concat<span style="color: #bc6ec5;">(</span>first<span style="color: #bc6ec5;">)</span>;
<span style="color: #4f97d7;">}</span>
console.log<span style="color: #4f97d7;">(</span>worksForFunctionsToo<span style="color: #bc6ec5;">(</span><span style="color: #da8548; font-weight: bold;">1</span>,<span style="color: #da8548; font-weight: bold;">2</span>,<span style="color: #da8548; font-weight: bold;">3</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>; <span style="color: #687080; background-color: #292e34; font-style: italic;">// </span><span style="color: #687080; background-color: #292e34; font-style: italic;">[2, 3, 1]</span>
</pre>
</div>
</section>
<section id="slide-org8538956">
<h3 id="org8538956"><code>for ... of</code></h3>
<div class="org-src-container">

<pre  class="src src-javascript"><span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">numbers</span> = <span style="color: #4f97d7;">[</span><span style="color: #da8548; font-weight: bold;">1</span>,<span style="color: #da8548; font-weight: bold;">2</span>,<span style="color: #da8548; font-weight: bold;">3</span>,<span style="color: #da8548; font-weight: bold;">4</span>,<span style="color: #da8548; font-weight: bold;">5</span><span style="color: #4f97d7;">]</span>;
<span style="color: #c678dd; font-weight: bold;">for</span> <span style="color: #4f97d7;">(</span><span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">i</span> <span style="color: #c678dd; font-weight: bold;">in</span> numbers<span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">k</span> = numbers<span style="color: #bc6ec5;">[</span>i<span style="color: #bc6ec5;">]</span>;
  console.log<span style="color: #bc6ec5;">(</span>i + <span style="color: #da8548; font-weight: bold;">1</span><span style="color: #bc6ec5;">)</span>; <span style="color: #687080; background-color: #292e34; font-style: italic;">// </span><span style="color: #687080; background-color: #292e34; font-style: italic;">"01", "11", etc.</span>
  <span style="color: #687080; background-color: #292e34; font-style: italic;">/* </span><span style="color: #687080; background-color: #292e34; font-style: italic;">... */</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>

<div class="org-src-container">

<pre  class="fragment roll-in"><span style="color: #c678dd; font-weight: bold;">for</span> <span style="color: #4f97d7;">(</span><span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">number</span> of numbers<span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">k</span> = numbers;
  <span style="color: #687080; background-color: #292e34; font-style: italic;">/* </span><span style="color: #687080; background-color: #292e34; font-style: italic;">... */</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>

<div class="org-src-container">

<pre  class="fragment roll-in"><span style="color: #c678dd; font-weight: bold;">for</span> <span style="color: #4f97d7;">(</span><span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #bc6ec5;">[</span><span style="color: #61afef;">index</span>, <span style="color: #61afef;">number</span><span style="color: #bc6ec5;">]</span> of numbers.entries<span style="color: #bc6ec5;">()</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">k</span> = numbers;
  console.log<span style="color: #bc6ec5;">(</span>index + <span style="color: #da8548; font-weight: bold;">1</span><span style="color: #bc6ec5;">)</span>; <span style="color: #687080; background-color: #292e34; font-style: italic;">// </span><span style="color: #687080; background-color: #292e34; font-style: italic;">1, 2, ...</span>
  <span style="color: #687080; background-color: #292e34; font-style: italic;">/* </span><span style="color: #687080; background-color: #292e34; font-style: italic;">... */</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>

</section>
<section id="slide-org058884e">
<h3 id="org058884e">E mais&#x2026;</h3>
<ul>
<li>Promessas</li>
<li>Geradores</li>
<li>Funções assíncronas</li>
<li>Módulos nativos, <i>proxies</i>, etc.</li>

</ul>

</section>
</section>
<section>
<section id="slide-orgd0ced23">
<h2 id="orgd0ced23">Controle de complexidade</h2>
<ul>
<li>Abstração</li>
<li>Composição</li>

</ul>

</section>
<section id="slide-orgcab40a2">
<h3 id="orgcab40a2">Abstração</h3>
<p>
DRY - <b>D</b>on't <b>R</b>epeat <b>Y</b>ourself
</p>

<div class="org-src-container">

<pre  class="src src-javascript"><span style="color: #c678dd; font-weight: bold;">function</span> <span style="color: #61afef; font-weight: bold;">addOne</span> <span style="color: #4f97d7;">(</span><span style="color: #61afef;">list</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">newList</span> = <span style="color: #bc6ec5;">[]</span>;
  <span style="color: #c678dd; font-weight: bold;">for</span> <span style="color: #bc6ec5;">(</span><span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">element</span> of list<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
    newList.push<span style="color: #2d9574;">(</span>element + <span style="color: #da8548; font-weight: bold;">1</span><span style="color: #2d9574;">)</span>;
  <span style="color: #bc6ec5;">}</span>

  <span style="color: #c678dd; font-weight: bold;">return</span> newList;
<span style="color: #4f97d7;">}</span>

<span style="color: #c678dd; font-weight: bold;">function</span> <span style="color: #61afef; font-weight: bold;">square</span> <span style="color: #4f97d7;">(</span><span style="color: #61afef;">list</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">newList</span> = <span style="color: #bc6ec5;">[]</span>;
  <span style="color: #c678dd; font-weight: bold;">for</span> <span style="color: #bc6ec5;">(</span><span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">element</span> of list<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
    newList.push<span style="color: #2d9574;">(</span>element * element<span style="color: #2d9574;">)</span>;
  <span style="color: #bc6ec5;">}</span>

  <span style="color: #c678dd; font-weight: bold;">return</span> newList;
<span style="color: #4f97d7;">}</span>
</pre>
</div>

</section>
<section id="slide-org1793c01">
<h3 id="org1793c01">Abstração</h3>
<div class="org-src-container">

<pre  class="src src-javascript"><span style="color: #c678dd; font-weight: bold;">function</span> <span style="color: #61afef; font-weight: bold;">map</span> <span style="color: #4f97d7;">(</span><span style="color: #61afef;">list</span>, <span style="color: #61afef;">fn</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">newList</span> = <span style="color: #bc6ec5;">[]</span>;
  <span style="color: #c678dd; font-weight: bold;">for</span> <span style="color: #bc6ec5;">(</span><span style="color: #c678dd; font-weight: bold;">let</span> <span style="color: #61afef;">element</span> of list<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
    newList.push<span style="color: #2d9574;">(</span>fn<span style="color: #67b11d;">(</span>element<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>;
  <span style="color: #bc6ec5;">}</span>

  <span style="color: #c678dd; font-weight: bold;">return</span> newList;
<span style="color: #4f97d7;">}</span>

<span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">addOne</span> = <span style="color: #4f97d7;">(</span>list<span style="color: #4f97d7;">)</span> =&gt; map<span style="color: #4f97d7;">(</span>list, x =&gt; x+<span style="color: #da8548; font-weight: bold;">1</span><span style="color: #4f97d7;">)</span>;
<span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">square</span> = <span style="color: #4f97d7;">(</span>list<span style="color: #4f97d7;">)</span> =&gt; map<span style="color: #4f97d7;">(</span>list, x =&gt; x*x<span style="color: #4f97d7;">)</span>;
</pre>
</div>

</section>
