palestra-2018-02-06.org
** Abstração

#+BEGIN_SRC javascript
  function popToaster (message, timeout, type) {
    toaster.pop({
      type,
      title: '',
      body: message,
      showCloseButton: true,
      timeout
    });
  }

  function showErrorToaster (message, timeout = 2000) {
    popToaster(message, timeout, 'error');
  }

  function showInfoToaster (message, timeout = 2000) {
    popToaster(message, timeout, 'info');
  }

  function showSuccessToaster (message, timeout = 2000) {
    popToaster(message, timeout, 'success');
  }
#+END_SRC
** Composição

#+BEGIN_SRC javascript
let x = 1;

function globalsDontCompose () {
  x += x;
}

globalsDontCompose(); // x = 2
const TwoX = x;

globalsDontCompose(); // x = 4
const FourX = x;
#+END_SRC

#+ATTR_REVEAL: :frag roll-in
#+BEGIN_SRC javascript
const x = 1;

function timesTwo (n) {
  return 2*n;
}

const TwoX = timesTwo(x);
const FourX = timesTwo(timesTwo(x)); // etc...
#+END_SRC

#+ATTR_REVEAL: :frag roll-in
#+BEGIN_SRC javascript
const compose = f => g => (x) => f(g(x));
const timesFour = compose(timesTwo)(timesTwo);
const nthPowerOfTwo = n => [...range(n-1)].reduce(compose(timesTwo), x => x)(2);
console.log(nthPowerOfTwo(10)); // 1024
#+END_SRC

* Processamento de listas
  - =map=
  - =filter=
  - =reduce=

** =map=

   Listas → Listas de mesmo tamanho

#+BEGIN_SRC javascript
// modelo
function mapModel (list, functionToApply) {
  const mappedList = [];
  for (const element of list) {
    mappedList.push(functionToApply(element));
  }
  return mappedList;
}
#+END_SRC

#+ATTR_REVEAL: :frag roll-in
   #+BEGIN_SRC javascript
   const list1 = [1, 2, 3, 4, 5];
   const list2 = list1.map(x => x*x); // [1, 4, 9, 16, 25]
   const list3 = list1.map(timesTwo).map(square); // [4, 16, 36, 64, 100]
   #+END_SRC

** =filter=

   Listas → Listas potencialmente menores

#+BEGIN_SRC javascript
function filterModel (list, predicate) {
  const filteredList = [];
  for (const element of list) {
    if (predicate(element)) {
      filteredList.push(element);
    }
  }
  return filteredList;
}
#+END_SRC

#+ATTR_REVEAL: :frag roll-in
#+BEGIN_SRC javascript
const isEven = x => x % 2 === 0;
console.log([1,2,3,4,5].filter(isEven)); // [2, 4]
#+END_SRC

#+ATTR_REVEAL: :frag roll-in
#+BEGIN_SRC javascript
function removeIfContains (list, elementToRemove) {
  return list.filter(element => element !== elementToRemove);
}
#+END_SRC

