palestra-2018-02-06.html
<section id="slide-orge1f6fdb">
<h3 id="orge1f6fdb">Abstração</h3>
<div class="org-src-container">

<pre  class="src src-javascript"><span style="color: #c678dd; font-weight: bold;">function</span> <span style="color: #61afef; font-weight: bold;">popToaster</span> <span style="color: #4f97d7;">(</span><span style="color: #61afef;">message</span>, <span style="color: #61afef;">timeout</span>, <span style="color: #61afef;">type</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
  toaster.pop<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">{</span>
    type,
    title: <span style="color: #98be65;">''</span>,
    body: message,
    showCloseButton: <span style="color: #da8548; font-weight: bold;">true</span>,
    timeout
  <span style="color: #2d9574;">}</span><span style="color: #bc6ec5;">)</span>;
<span style="color: #4f97d7;">}</span>

<span style="color: #c678dd; font-weight: bold;">function</span> <span style="color: #61afef; font-weight: bold;">showErrorToaster</span> <span style="color: #4f97d7;">(</span><span style="color: #61afef;">message</span>, <span style="color: #61afef;">timeout</span> = <span style="color: #da8548; font-weight: bold;">2000</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
  popToaster<span style="color: #bc6ec5;">(</span>message, timeout, <span style="color: #98be65;">'error'</span><span style="color: #bc6ec5;">)</span>;
<span style="color: #4f97d7;">}</span>

<span style="color: #c678dd; font-weight: bold;">function</span> <span style="color: #61afef; font-weight: bold;">showInfoToaster</span> <span style="color: #4f97d7;">(</span><span style="color: #61afef;">message</span>, <span style="color: #61afef;">timeout</span> = <span style="color: #da8548; font-weight: bold;">2000</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
  popToaster<span style="color: #bc6ec5;">(</span>message, timeout, <span style="color: #98be65;">'info'</span><span style="color: #bc6ec5;">)</span>;
<span style="color: #4f97d7;">}</span>

<span style="color: #c678dd; font-weight: bold;">function</span> <span style="color: #61afef; font-weight: bold;">showSuccessToaster</span> <span style="color: #4f97d7;">(</span><span style="color: #61afef;">message</span>, <span style="color: #61afef;">timeout</span> = <span style="color: #da8548; font-weight: bold;">2000</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
  popToaster<span style="color: #bc6ec5;">(</span>message, timeout, <span style="color: #98be65;">'success'</span><span style="color: #bc6ec5;">)</span>;
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</section>
<section id="slide-orgf72bda1">
<h3 id="orgf72bda1">Composição</h3>
<div class="org-src-container">

<pre  class="src src-javascript"><span style="color: #c678dd; font-weight: bold;">let</span> <span style="color: #61afef;">x</span> = <span style="color: #da8548; font-weight: bold;">1</span>;

<span style="color: #c678dd; font-weight: bold;">function</span> <span style="color: #61afef; font-weight: bold;">globalsDontCompose</span> <span style="color: #4f97d7;">()</span> <span style="color: #4f97d7;">{</span>
  x += x;
<span style="color: #4f97d7;">}</span>

globalsDontCompose<span style="color: #4f97d7;">()</span>; <span style="color: #687080; background-color: #292e34; font-style: italic;">// </span><span style="color: #687080; background-color: #292e34; font-style: italic;">x = 2</span>
<span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">TwoX</span> = x;

globalsDontCompose<span style="color: #4f97d7;">()</span>; <span style="color: #687080; background-color: #292e34; font-style: italic;">// </span><span style="color: #687080; background-color: #292e34; font-style: italic;">x = 4</span>
<span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">FourX</span> = x;
</pre>
</div>

<div class="org-src-container">

<pre  class="fragment roll-in"><span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">x</span> = <span style="color: #da8548; font-weight: bold;">1</span>;

<span style="color: #c678dd; font-weight: bold;">function</span> <span style="color: #61afef; font-weight: bold;">timesTwo</span> <span style="color: #4f97d7;">(</span><span style="color: #61afef;">n</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #c678dd; font-weight: bold;">return</span> <span style="color: #da8548; font-weight: bold;">2</span>*n;
<span style="color: #4f97d7;">}</span>

<span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">TwoX</span> = timesTwo<span style="color: #4f97d7;">(</span>x<span style="color: #4f97d7;">)</span>;
<span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">FourX</span> = timesTwo<span style="color: #4f97d7;">(</span>timesTwo<span style="color: #bc6ec5;">(</span>x<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>; <span style="color: #687080; background-color: #292e34; font-style: italic;">// </span><span style="color: #687080; background-color: #292e34; font-style: italic;">etc...</span>
</pre>
</div>

<div class="org-src-container">

<pre  class="fragment roll-in"><span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">compose</span> = f =&gt; g =&gt; <span style="color: #4f97d7;">(</span>x<span style="color: #4f97d7;">)</span> =&gt; f<span style="color: #4f97d7;">(</span>g<span style="color: #bc6ec5;">(</span>x<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>;
<span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">timesFour</span> = compose<span style="color: #4f97d7;">(</span>timesTwo<span style="color: #4f97d7;">)(</span>timesTwo<span style="color: #4f97d7;">)</span>;
<span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">nthPowerOfTwo</span> = n =&gt; <span style="color: #4f97d7;">[</span>...range<span style="color: #bc6ec5;">(</span>n-<span style="color: #da8548; font-weight: bold;">1</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">]</span>.reduce<span style="color: #4f97d7;">(</span>compose<span style="color: #bc6ec5;">(</span>timesTwo<span style="color: #bc6ec5;">)</span>, x =&gt; x<span style="color: #4f97d7;">)(</span><span style="color: #da8548; font-weight: bold;">2</span><span style="color: #4f97d7;">)</span>;
console.log<span style="color: #4f97d7;">(</span>nthPowerOfTwo<span style="color: #bc6ec5;">(</span><span style="color: #da8548; font-weight: bold;">10</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>; <span style="color: #687080; background-color: #292e34; font-style: italic;">// </span><span style="color: #687080; background-color: #292e34; font-style: italic;">1024</span>
</pre>
</div>

</section>
</section>
<section>
<section id="slide-orgde4e829">
<h2 id="orgde4e829">Processamento de listas</h2>
<ul>
<li><code>map</code></li>
<li><code>filter</code></li>
<li><code>reduce</code></li>

</ul>

</section>
<section id="slide-org3ec9948">
<h3 id="org3ec9948"><code>map</code></h3>
<p>
Listas → Listas de mesmo tamanho
</p>

<div class="org-src-container">

<pre  class="src src-javascript"><span style="color: #687080; background-color: #292e34; font-style: italic;">// </span><span style="color: #687080; background-color: #292e34; font-style: italic;">modelo</span>
<span style="color: #c678dd; font-weight: bold;">function</span> <span style="color: #61afef; font-weight: bold;">mapModel</span> <span style="color: #4f97d7;">(</span><span style="color: #61afef;">list</span>, <span style="color: #61afef;">functionToApply</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">mappedList</span> = <span style="color: #bc6ec5;">[]</span>;
  <span style="color: #c678dd; font-weight: bold;">for</span> <span style="color: #bc6ec5;">(</span><span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">element</span> of list<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
    mappedList.push<span style="color: #2d9574;">(</span>functionToApply<span style="color: #67b11d;">(</span>element<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>;
  <span style="color: #bc6ec5;">}</span>
  <span style="color: #c678dd; font-weight: bold;">return</span> mappedList;
<span style="color: #4f97d7;">}</span>
</pre>
</div>

<div class="org-src-container">

<pre  class="fragment roll-in"><span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">list1</span> = <span style="color: #4f97d7;">[</span><span style="color: #da8548; font-weight: bold;">1</span>, <span style="color: #da8548; font-weight: bold;">2</span>, <span style="color: #da8548; font-weight: bold;">3</span>, <span style="color: #da8548; font-weight: bold;">4</span>, <span style="color: #da8548; font-weight: bold;">5</span><span style="color: #4f97d7;">]</span>;
<span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">list2</span> = list1.map<span style="color: #4f97d7;">(</span>x =&gt; x*x<span style="color: #4f97d7;">)</span>; <span style="color: #687080; background-color: #292e34; font-style: italic;">// </span><span style="color: #687080; background-color: #292e34; font-style: italic;">[1, 4, 9, 16, 25]</span>
<span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">list3</span> = list1.map<span style="color: #4f97d7;">(</span>timesTwo<span style="color: #4f97d7;">)</span>.map<span style="color: #4f97d7;">(</span>square<span style="color: #4f97d7;">)</span>; <span style="color: #687080; background-color: #292e34; font-style: italic;">// </span><span style="color: #687080; background-color: #292e34; font-style: italic;">[4, 16, 36, 64, 100]</span>
</pre>
</div>

</section>
<section id="slide-orgb75b0c9">
<h3 id="orgb75b0c9"><code>filter</code></h3>
<p>
Listas → Listas potencialmente menores
</p>

<div class="org-src-container">

<pre  class="src src-javascript"><span style="color: #c678dd; font-weight: bold;">function</span> <span style="color: #61afef; font-weight: bold;">filterModel</span> <span style="color: #4f97d7;">(</span><span style="color: #61afef;">list</span>, <span style="color: #61afef;">predicate</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">filteredList</span> = <span style="color: #bc6ec5;">[]</span>;
  <span style="color: #c678dd; font-weight: bold;">for</span> <span style="color: #bc6ec5;">(</span><span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">element</span> of list<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
    <span style="color: #c678dd; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span>predicate<span style="color: #67b11d;">(</span>element<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span> <span style="color: #2d9574;">{</span>
      filteredList.push<span style="color: #67b11d;">(</span>element<span style="color: #67b11d;">)</span>;
    <span style="color: #2d9574;">}</span>
  <span style="color: #bc6ec5;">}</span>
  <span style="color: #c678dd; font-weight: bold;">return</span> filteredList;
<span style="color: #4f97d7;">}</span>
</pre>
</div>

<div class="org-src-container">

<pre  class="fragment roll-in"><span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">isEven</span> = x =&gt; x % <span style="color: #da8548; font-weight: bold;">2</span> === <span style="color: #da8548; font-weight: bold;">0</span>;
console.log<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">[</span><span style="color: #da8548; font-weight: bold;">1</span>,<span style="color: #da8548; font-weight: bold;">2</span>,<span style="color: #da8548; font-weight: bold;">3</span>,<span style="color: #da8548; font-weight: bold;">4</span>,<span style="color: #da8548; font-weight: bold;">5</span><span style="color: #bc6ec5;">]</span>.filter<span style="color: #bc6ec5;">(</span>isEven<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>; <span style="color: #687080; background-color: #292e34; font-style: italic;">// </span><span style="color: #687080; background-color: #292e34; font-style: italic;">[2, 4]</span>
</pre>
</div>

<div class="org-src-container">

<pre  class="fragment roll-in"><span style="color: #c678dd; font-weight: bold;">function</span> <span style="color: #61afef; font-weight: bold;">removeIfContains</span> <span style="color: #4f97d7;">(</span><span style="color: #61afef;">list</span>, <span style="color: #61afef;">elementToRemove</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #c678dd; font-weight: bold;">return</span> list.filter<span style="color: #bc6ec5;">(</span>element =&gt; element !== elementToRemove<span style="color: #bc6ec5;">)</span>;
<span style="color: #4f97d7;">}</span>
</pre>
</div>

</section>
