palestra-2018-02-06.org
** =reduce=

   Lista → Combinação de elementos da lista original

#+BEGIN_SRC javascript
function reduceModel (list, combineFunction, initialValue) {
  // note the different number of arguments
  let result = initialValue;
  for (const element of list) {
    result = combineFunction(result, element);
  }
  return result;
}
#+END_SRC

#+ATTR_REVEAL: :frag roll-in
#+BEGIN_SRC javascript
const listSum = list => list.reduce((a, b) => a + b, 0);
const listProduct = list => list.reduce((a, b) => a * b, 1);
const flatten = listOfLists => listOfLists.reduce(
  (flattened, element) => flattened.concat(element), []);

console.log(listSum([1,2,3,4,5,6,7,8,9,10])); // 55
console.log(listProduct([1,2,3,4,5])); // 120
console.log(flatten([[1, 2], 3, [], [4]]); // [1,2,3,4]
#+END_SRC

** Argumentos adicionais

#+BEGIN_SRC javascript
function removeRepetitions (list) {
  return list.filter(
    (element, index, originalArray) => (index === originalArray.indexOf(element)));
#+END_SRC

* Geradores
Interrupção/continuação do fluxo de controle.

#+BEGIN_SRC javascript
function *helloGenerator () {
  /* anything here will be done before the line below */
  yield 1;
  /* anything here will be done before the line below */
  yield 2;
  /* anything here will be done before the line below */
  yield 3;
}

const hello = helloGenerator();
console.log(hello.next().value); // 1
console.log(hello.next().value); // 2
console.log(hello.next().value); // 3
#+END_SRC

#+ATTR_REVEAL: :frag roll-in
#+BEGIN_SRC javascript
console.log(hello.next().value); // undefined
#+END_SRC

#+ATTR_REVEAL: :frag roll-in
#+BEGIN_SRC javascript
for (const i of helloGenerator()) {
  console.log(i);
}
// > 1
// > 2
// > 3
#+END_SRC

** Vantagens
Uso de espaço constante, sem listas intermediárias.

#+BEGIN_SRC javascript
// Space complexity: O(n)
function dumbRange (n) {
  // obs: found in viewPanels.controller.js
  const numbers = [];
  for (let i = 0; i < n; i++) {
    numbers.push(i);
  }
  return numbers;
}
#+END_SRC

#+BEGIN_SRC javascript
// Space complexity: O(1)
function *smartRange (n) {
  for (let i = 0; i < n; i++) {
    yield i;
  }
}
#+END_SRC

