palestra-2018-02-06.html
<section id="slide-orga48ebc7">
<h3 id="orga48ebc7"><code>reduce</code></h3>
<p>
Lista → Combinação de elementos da lista original
</p>

<div class="org-src-container">

<pre  class="src src-javascript"><span style="color: #c678dd; font-weight: bold;">function</span> <span style="color: #61afef; font-weight: bold;">reduceModel</span> <span style="color: #4f97d7;">(</span><span style="color: #61afef;">list</span>, <span style="color: #61afef;">combineFunction</span>, <span style="color: #61afef;">initialValue</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #687080; background-color: #292e34; font-style: italic;">// </span><span style="color: #687080; background-color: #292e34; font-style: italic;">note the different number of arguments</span>
  <span style="color: #c678dd; font-weight: bold;">let</span> <span style="color: #61afef;">result</span> = initialValue;
  <span style="color: #c678dd; font-weight: bold;">for</span> <span style="color: #bc6ec5;">(</span><span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">element</span> of list<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
    result = combineFunction<span style="color: #2d9574;">(</span>result, element<span style="color: #2d9574;">)</span>;
  <span style="color: #bc6ec5;">}</span>
  <span style="color: #c678dd; font-weight: bold;">return</span> result;
<span style="color: #4f97d7;">}</span>
</pre>
</div>

<div class="org-src-container">

<pre  class="fragment roll-in"><span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">listSum</span> = list =&gt; list.reduce<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">(</span>a, b<span style="color: #bc6ec5;">)</span> =&gt; a + b, <span style="color: #da8548; font-weight: bold;">0</span><span style="color: #4f97d7;">)</span>;
<span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">listProduct</span> = list =&gt; list.reduce<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">(</span>a, b<span style="color: #bc6ec5;">)</span> =&gt; a * b, <span style="color: #da8548; font-weight: bold;">1</span><span style="color: #4f97d7;">)</span>;
<span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">flatten</span> = listOfLists =&gt; listOfLists.reduce<span style="color: #4f97d7;">(</span>
  <span style="color: #bc6ec5;">(</span>flattened, element<span style="color: #bc6ec5;">)</span> =&gt; flattened.concat<span style="color: #bc6ec5;">(</span>element<span style="color: #bc6ec5;">)</span>, <span style="color: #bc6ec5;">[]</span><span style="color: #4f97d7;">)</span>;

console.log<span style="color: #4f97d7;">(</span>listSum<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">[</span><span style="color: #da8548; font-weight: bold;">1</span>,<span style="color: #da8548; font-weight: bold;">2</span>,<span style="color: #da8548; font-weight: bold;">3</span>,<span style="color: #da8548; font-weight: bold;">4</span>,<span style="color: #da8548; font-weight: bold;">5</span>,<span style="color: #da8548; font-weight: bold;">6</span>,<span style="color: #da8548; font-weight: bold;">7</span>,<span style="color: #da8548; font-weight: bold;">8</span>,<span style="color: #da8548; font-weight: bold;">9</span>,<span style="color: #da8548; font-weight: bold;">10</span><span style="color: #2d9574;">]</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>; <span style="color: #687080; background-color: #292e34; font-style: italic;">// </span><span style="color: #687080; background-color: #292e34; font-style: italic;">55</span>
console.log<span style="color: #4f97d7;">(</span>listProduct<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">[</span><span style="color: #da8548; font-weight: bold;">1</span>,<span style="color: #da8548; font-weight: bold;">2</span>,<span style="color: #da8548; font-weight: bold;">3</span>,<span style="color: #da8548; font-weight: bold;">4</span>,<span style="color: #da8548; font-weight: bold;">5</span><span style="color: #2d9574;">]</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>; <span style="color: #687080; background-color: #292e34; font-style: italic;">// </span><span style="color: #687080; background-color: #292e34; font-style: italic;">120</span>
console.log<span style="color: #4f97d7;">(</span>flatten<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">[</span><span style="color: #67b11d;">[</span><span style="color: #da8548; font-weight: bold;">1</span>, <span style="color: #da8548; font-weight: bold;">2</span><span style="color: #67b11d;">]</span>, <span style="color: #da8548; font-weight: bold;">3</span>, <span style="color: #67b11d;">[]</span>, <span style="color: #67b11d;">[</span><span style="color: #da8548; font-weight: bold;">4</span><span style="color: #67b11d;">]</span><span style="color: #2d9574;">]</span><span style="color: #bc6ec5;">)</span>; <span style="color: #687080; background-color: #292e34; font-style: italic;">// </span><span style="color: #687080; background-color: #292e34; font-style: italic;">[1,2,3,4]</span>
</pre>
</div>

</section>
<section id="slide-orgff6128f">
<h3 id="orgff6128f">Argumentos adicionais</h3>
<div class="org-src-container">

<pre  class="src src-javascript"><span style="color: #c678dd; font-weight: bold;">function</span> <span style="color: #61afef; font-weight: bold;">removeRepetitions</span> <span style="color: #4f97d7;">(</span><span style="color: #61afef;">list</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #c678dd; font-weight: bold;">return</span> list.filter<span style="color: #bc6ec5;">(</span>
    <span style="color: #2d9574;">(</span>element, index, originalArray<span style="color: #2d9574;">)</span> =&gt; <span style="color: #2d9574;">(</span>index === originalArray.indexOf<span style="color: #67b11d;">(</span>element<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>;
</pre>
</div>

</section>
</section>
<section>
<section id="slide-org79a9db1">
<h2 id="org79a9db1">Geradores</h2>
<p>
Interrupção/continuação do fluxo de controle.
</p>

<div class="org-src-container">

<pre  class="src src-javascript"><span style="color: #c678dd; font-weight: bold;">function</span> *<span style="color: #61afef; font-weight: bold;">helloGenerator</span> <span style="color: #4f97d7;">()</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #687080; background-color: #292e34; font-style: italic;">/* </span><span style="color: #687080; background-color: #292e34; font-style: italic;">anything here will be done before the line below */</span>
  <span style="color: #c678dd; font-weight: bold;">yield</span> <span style="color: #da8548; font-weight: bold;">1</span>;
  <span style="color: #687080; background-color: #292e34; font-style: italic;">/* </span><span style="color: #687080; background-color: #292e34; font-style: italic;">anything here will be done before the line below */</span>
  <span style="color: #c678dd; font-weight: bold;">yield</span> <span style="color: #da8548; font-weight: bold;">2</span>;
  <span style="color: #687080; background-color: #292e34; font-style: italic;">/* </span><span style="color: #687080; background-color: #292e34; font-style: italic;">anything here will be done before the line below */</span>
  <span style="color: #c678dd; font-weight: bold;">yield</span> <span style="color: #da8548; font-weight: bold;">3</span>;
<span style="color: #4f97d7;">}</span>

<span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">hello</span> = helloGenerator<span style="color: #4f97d7;">()</span>;
console.log<span style="color: #4f97d7;">(</span>hello.next<span style="color: #bc6ec5;">()</span>.value<span style="color: #4f97d7;">)</span>; <span style="color: #687080; background-color: #292e34; font-style: italic;">// </span><span style="color: #687080; background-color: #292e34; font-style: italic;">1</span>
console.log<span style="color: #4f97d7;">(</span>hello.next<span style="color: #bc6ec5;">()</span>.value<span style="color: #4f97d7;">)</span>; <span style="color: #687080; background-color: #292e34; font-style: italic;">// </span><span style="color: #687080; background-color: #292e34; font-style: italic;">2</span>
console.log<span style="color: #4f97d7;">(</span>hello.next<span style="color: #bc6ec5;">()</span>.value<span style="color: #4f97d7;">)</span>; <span style="color: #687080; background-color: #292e34; font-style: italic;">// </span><span style="color: #687080; background-color: #292e34; font-style: italic;">3</span>
</pre>
</div>

<div class="org-src-container">

<pre  class="fragment roll-in">console.log<span style="color: #4f97d7;">(</span>hello.next<span style="color: #bc6ec5;">()</span>.value<span style="color: #4f97d7;">)</span>; <span style="color: #687080; background-color: #292e34; font-style: italic;">// </span><span style="color: #687080; background-color: #292e34; font-style: italic;">undefined</span>
</pre>
</div>

<div class="org-src-container">

<pre  class="fragment roll-in"><span style="color: #c678dd; font-weight: bold;">for</span> <span style="color: #4f97d7;">(</span><span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">i</span> of helloGenerator<span style="color: #bc6ec5;">()</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
  console.log<span style="color: #bc6ec5;">(</span>i<span style="color: #bc6ec5;">)</span>;
<span style="color: #4f97d7;">}</span>
<span style="color: #687080; background-color: #292e34; font-style: italic;">// </span><span style="color: #687080; background-color: #292e34; font-style: italic;">&gt; 1</span>
<span style="color: #687080; background-color: #292e34; font-style: italic;">// </span><span style="color: #687080; background-color: #292e34; font-style: italic;">&gt; 2</span>
<span style="color: #687080; background-color: #292e34; font-style: italic;">// </span><span style="color: #687080; background-color: #292e34; font-style: italic;">&gt; 3</span>
</pre>
</div>

</section>
<section id="slide-orgca91cd9">
<h3 id="orgca91cd9">Vantagens</h3>
<p>
Uso de espaço constante, sem listas intermediárias.
</p>

<div class="org-src-container">

<pre  class="src src-javascript"><span style="color: #687080; background-color: #292e34; font-style: italic;">// </span><span style="color: #687080; background-color: #292e34; font-style: italic;">Space complexity: O(n)</span>
<span style="color: #c678dd; font-weight: bold;">function</span> <span style="color: #61afef; font-weight: bold;">dumbRange</span> <span style="color: #4f97d7;">(</span><span style="color: #61afef;">n</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #687080; background-color: #292e34; font-style: italic;">// </span><span style="color: #687080; background-color: #292e34; font-style: italic;">obs: found in viewPanels.controller.js</span>
  <span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">numbers</span> = <span style="color: #bc6ec5;">[]</span>;
  <span style="color: #c678dd; font-weight: bold;">for</span> <span style="color: #bc6ec5;">(</span><span style="color: #c678dd; font-weight: bold;">let</span> <span style="color: #61afef;">i</span> = <span style="color: #da8548; font-weight: bold;">0</span>; i &lt; n; i++<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
    numbers.push<span style="color: #2d9574;">(</span>i<span style="color: #2d9574;">)</span>;
  <span style="color: #bc6ec5;">}</span>
  <span style="color: #c678dd; font-weight: bold;">return</span> numbers;
<span style="color: #4f97d7;">}</span>
</pre>
</div>

<div class="org-src-container">

<pre  class="src src-javascript"><span style="color: #687080; background-color: #292e34; font-style: italic;">// </span><span style="color: #687080; background-color: #292e34; font-style: italic;">Space complexity: O(1)</span>
<span style="color: #c678dd; font-weight: bold;">function</span> *<span style="color: #61afef; font-weight: bold;">smartRange</span> <span style="color: #4f97d7;">(</span>n<span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #c678dd; font-weight: bold;">for</span> <span style="color: #bc6ec5;">(</span><span style="color: #c678dd; font-weight: bold;">let</span> <span style="color: #61afef;">i</span> = <span style="color: #da8548; font-weight: bold;">0</span>; i &lt; n; i++<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
    <span style="color: #c678dd; font-weight: bold;">yield</span> i;
  <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>

</section>
