palestra-2018-02-06.org
** Vantagens

Processamento de listas em uma única passada (listas preguiçosas).

#+BEGIN_SRC javascript
const dumbSquaredEvensSum = // 4 passes
  (n) => dumbRange(n).filter(isEven).map(square).reduce((a, b) => a+b, 0);

function reduce (iterator, combineFunction, initialValue) {
  let result = initialValue;
  for (const element of iterator) {
    result = combineFunction(result, element);
  }
  return result;
}

const iteratorSum = (iterator) => reduce(iterator, (a, b) => a + b, 0);
const smartSquaredEvensSum = // One single pass
  (n) => iteratorSum(smartRange(n).filter(isEven).map(square));
#+END_SRC

** Vantagens
Geradores podem ser infinitos!

#+BEGIN_SRC javascript
function *zeroToInfinity () {
  let n = 0;
  while (true) {
    yield n;
    n++;
  }
}

const allPrimes = zeroToInfinity().filter(isPrime).forEach(console.log);
#+END_SRC

#+ATTR_REVEAL: :frag roll-in
#+BEGIN_SRC javascript
function *readYuuuugeFile (fileDescriptor) {
  let line = fileDescriptor.readLine();
  while (line) {
    yield line;
    line = fileDescriptor.readLine();
  }
}

const lengthOfWholeFile = fileDescriptor => iteratorSum(readYuuuugeFile(fileDescriptor).map(line => line.length));
#+END_SRC

* Promessas

Computações assíncronas.

#+BEGIN_SRC javascript
doSomethingAsynchronously()
  .then(doSomethingElse)
  .then(andThenAnotherThing)
  .then(andYetAnother) // ...
#+END_SRC

#+ATTR_REVEAL: :frag roll-in
Anatomia de uma promessa:

#+BEGIN_SRC javascript
const pendingPromise = {
  state: "pending",
}

const resolvedPromise = {
  state: "fulfilled",
  value: 1;
}

const rejectedPromise = {
  state: "rejected"
}
#+END_SRC

** =Promise.all=

#+BEGIN_SRC javascript
const firstRequest = $http.get("/blablabla").then(doSomething);
const secondRequest = $http.get("/whatever").then(doAnotherThing);

Promise.all(firstRequest, secondRequest)
  .then([firstResult, secondResult] => doSomethingWithTheTwo(firstResult, secondResult));

#+END_SRC

** Exceções

#+BEGIN_SRC javascript
function processRequest (requestRoute) {
  return $http.get(requestRoute)
    .then(response => firstAction(response))
    .then(firstResult => secondAction(firstResult))
    .then(secondResult => finalAction(secondResult))
    .catch(error => treatError(error));
}
#+END_SRC

** =async/await=

#+BEGIN_SRC javascript
async function processRequest2 (requestRoute) {
  try {
    const response = await $http.get(requestRoute);
    const result = await secondAction(firstAction(response));

    return finalAction(result);
  } catch error {
    treatError(error);
  }
}
#+END_SRC

