palestra-2018-02-06.html
<section id="slide-org4306f22">
<h3 id="org4306f22">Vantagens</h3>
<p>
Processamento de listas em uma única passada (listas preguiçosas).
</p>

<div class="org-src-container">

<pre  class="src src-javascript"><span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">dumbSquaredEvensSum</span> = <span style="color: #687080; background-color: #292e34; font-style: italic;">// </span><span style="color: #687080; background-color: #292e34; font-style: italic;">4 passes</span>
  <span style="color: #4f97d7;">(</span>n<span style="color: #4f97d7;">)</span> =&gt; dumbRange<span style="color: #4f97d7;">(</span>n<span style="color: #4f97d7;">)</span>.filter<span style="color: #4f97d7;">(</span>isEven<span style="color: #4f97d7;">)</span>.map<span style="color: #4f97d7;">(</span>square<span style="color: #4f97d7;">)</span>.reduce<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">(</span>a, b<span style="color: #bc6ec5;">)</span> =&gt; a+b, <span style="color: #da8548; font-weight: bold;">0</span><span style="color: #4f97d7;">)</span>;

<span style="color: #c678dd; font-weight: bold;">function</span> <span style="color: #61afef; font-weight: bold;">reduce</span> <span style="color: #4f97d7;">(</span><span style="color: #61afef;">iterator</span>, <span style="color: #61afef;">combineFunction</span>, <span style="color: #61afef;">initialValue</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #c678dd; font-weight: bold;">let</span> <span style="color: #61afef;">result</span> = initialValue;
  <span style="color: #c678dd; font-weight: bold;">for</span> <span style="color: #bc6ec5;">(</span><span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">element</span> of iterator<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
    result = combineFunction<span style="color: #2d9574;">(</span>result, element<span style="color: #2d9574;">)</span>;
  <span style="color: #bc6ec5;">}</span>
  <span style="color: #c678dd; font-weight: bold;">return</span> result;
<span style="color: #4f97d7;">}</span>

<span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">iteratorSum</span> = <span style="color: #4f97d7;">(</span>iterator<span style="color: #4f97d7;">)</span> =&gt; reduce<span style="color: #4f97d7;">(</span>iterator, <span style="color: #bc6ec5;">(</span>a, b<span style="color: #bc6ec5;">)</span> =&gt; a + b, <span style="color: #da8548; font-weight: bold;">0</span><span style="color: #4f97d7;">)</span>;
<span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">smartSquaredEvensSum</span> = <span style="color: #687080; background-color: #292e34; font-style: italic;">// </span><span style="color: #687080; background-color: #292e34; font-style: italic;">One single pass</span>
  <span style="color: #4f97d7;">(</span>n<span style="color: #4f97d7;">)</span> =&gt; iteratorSum<span style="color: #4f97d7;">(</span>smartRange<span style="color: #bc6ec5;">(</span>n<span style="color: #bc6ec5;">)</span>.filter<span style="color: #bc6ec5;">(</span>isEven<span style="color: #bc6ec5;">)</span>.map<span style="color: #bc6ec5;">(</span>square<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>;
</pre>
</div>

<p class="fragment roll-in">
Geradores podem ser infinitos!
</p>

<div class="org-src-container">

<pre  class="src src-javascript"><span style="color: #c678dd; font-weight: bold;">function</span> *<span style="color: #61afef; font-weight: bold;">zeroToInfinity</span> <span style="color: #4f97d7;">()</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #c678dd; font-weight: bold;">let</span> <span style="color: #61afef;">n</span> = <span style="color: #da8548; font-weight: bold;">0</span>;
  <span style="color: #c678dd; font-weight: bold;">while</span> <span style="color: #bc6ec5;">(</span><span style="color: #da8548; font-weight: bold;">true</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
    <span style="color: #c678dd; font-weight: bold;">yield</span> n;
    n++;
  <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>

<span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">allPrimes</span> = zeroToInfinity<span style="color: #4f97d7;">()</span>.filter<span style="color: #4f97d7;">(</span>isPrime<span style="color: #4f97d7;">)</span>.forEach<span style="color: #4f97d7;">(</span>console.log<span style="color: #4f97d7;">)</span>;
</pre>
</div>

<div class="org-src-container">

<pre  class="fragment roll-in"><span style="color: #c678dd; font-weight: bold;">function</span> *<span style="color: #61afef; font-weight: bold;">readYuuuugeFile</span> <span style="color: #4f97d7;">(</span>fileDescriptor<span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #c678dd; font-weight: bold;">let</span> <span style="color: #61afef;">line</span> = fileDescriptor.readLine<span style="color: #bc6ec5;">()</span>;
  <span style="color: #c678dd; font-weight: bold;">while</span> <span style="color: #bc6ec5;">(</span>line<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
    <span style="color: #c678dd; font-weight: bold;">yield</span> line;
    line = fileDescriptor.readLine<span style="color: #2d9574;">()</span>;
  <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>

<span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">lengthOfWholeFile</span> = fileDescriptor =&gt; iteratorSum<span style="color: #4f97d7;">(</span>readYuuuugeFile<span style="color: #bc6ec5;">(</span>fileDescriptor<span style="color: #bc6ec5;">)</span>.map<span style="color: #bc6ec5;">(</span>line =&gt; line.length<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>;
</pre>
</div>

</section>
</section>
<section>
<section id="slide-orgd38ca2f">
<h2 id="orgd38ca2f">Promessas</h2>
<p>
Computações assíncronas.
</p>

<div class="org-src-container">

<pre  class="src src-javascript">doSomethingAsynchronously<span style="color: #4f97d7;">()</span>
  .then<span style="color: #4f97d7;">(</span>doSomethingElse<span style="color: #4f97d7;">)</span>
  .then<span style="color: #4f97d7;">(</span>andThenAnotherThing<span style="color: #4f97d7;">)</span>
  .then<span style="color: #4f97d7;">(</span>andYetAnother<span style="color: #4f97d7;">)</span> <span style="color: #687080; background-color: #292e34; font-style: italic;">// </span><span style="color: #687080; background-color: #292e34; font-style: italic;">...</span>
</pre>
</div>

<p class="fragment roll-in">
Anatomia de uma promessa:
</p>

<div class="org-src-container">

<pre  class="src src-javascript"><span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">pendingPromise</span> = <span style="color: #4f97d7;">{</span>
  state: <span style="color: #98be65;">"pending"</span>,
<span style="color: #4f97d7;">}</span>

<span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">resolvedPromise</span> = <span style="color: #4f97d7;">{</span>
  state: <span style="color: #98be65;">"fulfilled"</span>,
  value: <span style="color: #da8548; font-weight: bold;">1</span>;
<span style="color: #4f97d7;">}</span>

<span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">rejectedPromise</span> = <span style="color: #4f97d7;">{</span>
  state: <span style="color: #98be65;">"rejected"</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>

</section>
<section id="slide-org899fcb6">
<h3 id="org899fcb6"><code>Promise.all</code></h3>
<div class="org-src-container">

<pre  class="src src-javascript"><span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">firstRequest</span> = $http.get<span style="color: #4f97d7;">(</span><span style="color: #98be65;">"/blablabla"</span><span style="color: #4f97d7;">)</span>.then<span style="color: #4f97d7;">(</span>doSomething<span style="color: #4f97d7;">)</span>;
<span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">secondRequest</span> = $http.get<span style="color: #4f97d7;">(</span><span style="color: #98be65;">"/whatever"</span><span style="color: #4f97d7;">)</span>.then<span style="color: #4f97d7;">(</span>doAnotherThing<span style="color: #4f97d7;">)</span>;

Promise.all<span style="color: #4f97d7;">(</span>firstRequest, secondRequest<span style="color: #4f97d7;">)</span>
  .then<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">[</span>firstResult, secondResult<span style="color: #bc6ec5;">]</span> =&gt; doSomethingWithTheTwo<span style="color: #bc6ec5;">(</span>firstResult, secondResult<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>;

</pre>
</div>

</section>
<section id="slide-orge16ecc4">
<h3 id="orge16ecc4">Exceções</h3>
<div class="org-src-container">

<pre  class="src src-javascript"><span style="color: #c678dd; font-weight: bold;">function</span> <span style="color: #61afef; font-weight: bold;">processRequest</span> <span style="color: #4f97d7;">(</span><span style="color: #61afef;">requestRoute</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #c678dd; font-weight: bold;">return</span> $http.get<span style="color: #bc6ec5;">(</span>requestRoute<span style="color: #bc6ec5;">)</span>
    .then<span style="color: #bc6ec5;">(</span>response =&gt; firstAction<span style="color: #2d9574;">(</span>response<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>
    .then<span style="color: #bc6ec5;">(</span>firstResult =&gt; secondAction<span style="color: #2d9574;">(</span>firstResult<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>
    .then<span style="color: #bc6ec5;">(</span>secondResult =&gt; finalAction<span style="color: #2d9574;">(</span>secondResult<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>
    .<span style="color: #c678dd; font-weight: bold;">catch</span><span style="color: #bc6ec5;">(</span>error =&gt; treatError<span style="color: #2d9574;">(</span>error<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>;
<span style="color: #4f97d7;">}</span>
</pre>
</div>

</section>
<section id="slide-orgf7b03b3">
<h3 id="orgf7b03b3"><code>async/await</code></h3>
<div class="org-src-container">

<pre  class="src src-javascript">async <span style="color: #c678dd; font-weight: bold;">function</span> processRequest2 <span style="color: #4f97d7;">(</span><span style="color: #61afef;">requestRoute</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #c678dd; font-weight: bold;">try</span> <span style="color: #bc6ec5;">{</span>
    <span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">response</span> = await $http.get<span style="color: #2d9574;">(</span>requestRoute<span style="color: #2d9574;">)</span>;
    <span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">result</span> = await secondAction<span style="color: #2d9574;">(</span>firstAction<span style="color: #67b11d;">(</span>response<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>;

    <span style="color: #c678dd; font-weight: bold;">return</span> finalAction<span style="color: #2d9574;">(</span>result<span style="color: #2d9574;">)</span>;
  <span style="color: #bc6ec5;">}</span> <span style="color: #c678dd; font-weight: bold;">catch</span> error <span style="color: #bc6ec5;">{</span>
    treatError<span style="color: #2d9574;">(</span>error<span style="color: #2d9574;">)</span>;
  <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>

</section>
</section>
